Revit 2027 API
RebarConstraint.GetTargetRebarConstraintType Method
 Gets the TargetRebarConstraintType of the handle on the other Rebar Element to which this RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'ToOtherRebar'.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TargetRebarConstraintType GetTargetRebarConstraintType()
Public Function GetTargetRebarConstraintType As TargetRebarConstraintType
public:
TargetRebarConstraintType GetTargetRebarConstraintType()
member GetTargetRebarConstraintType : unit -> TargetRebarConstraintType
Return Value
TargetRebarConstraintType
 Returns the TargetRebarConstraintType of the handle on the other Rebar Element to which this RebarConstraint is attached.
Exceptions
Exception | Condition
InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace